examenproef/app/Http/Controllers/HomeController.php

select * from `years`
---
    public function index(){
        $years = Year::all();