examenproef/app/Http/Controllers/YearController.php

    public function show(string $id)
    {
        $year = Year::find($id);
        $modules = Module::with(['lessonPlans', 'lessonPlans.subject'])->where('year_id', $year->id)->get();
---
select * from `years` where `years`.`id` = '1' limit 1
select * from `modules` where `modules`.`year_id` = 1 and `modules`.`year_id` is not null